Project/Toir.Adaptation/src/InformationRegisters/торо_НастройкиСтатусовСогласованияДокументов/торо_НастройкиСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="855de82d-7eee-4ce5-918b-4346b60b354b">
  <name>торо_НастройкиСтатусовСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5943df01-c248-4875-9da6-5ae08e091df5">
    <name>гкс_ПроводитьАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="64bc746f-49d7-4ab4-84dd-3377fcefa0f7">
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_НастройкиСогласованияДокументовТОиР/торо_НастройкиСогласованияДокументовТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="76fdcff5-ea27-4ce4-995b-ba054956d27f">
  <name>торо_НастройкиСогласованияДокументовТОиР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="017bf557-165a-4b3c-b248-d479e30f0986">
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ea9f51f7-5e46-4048-8bf9-835599b5dd9f">
    <name>гкс_ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="704f368c-ff91-4d81-a625-c349e9f696e8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7b25050a-54e2-4fa5-aa78-db38f28d44a1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b7f7ac30-29b0-4416-a4db-4fa622173b7c">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/гкс_ПроизвольныеНастройкиИнтеграций/гкс_ПроизвольныеНастройкиИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f7954be1-86f2-4e13-9837-d2a42dc4d403">
  <name>гкс_ПроизвольныеНастройкиИнтеграций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9f8eb78e-1cbe-41e9-9240-35ef4ace121a">
    <name>ДопСвойства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="05eaf328-d5be-4e7b-90f6-0c245f5888bc">
    <name>Свойства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4057ede0-2c77-4630-ba90-13eae2cb911b">
      <name>Ключ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7dbc80a5-8863-4cec-b3b3-b3c76d03b314">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/торо_РаботаССогласованиями/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

&ИзменениеИКонтроль("ПолучитьДанныеПоСтатусуДокумента")
Функция Расш_гкс_ПолучитьДанныеПоСтатусуДокумента(СпособСогласования, СтатусДокумента)

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Начальный", Ложь);
	СтруктураДанных.Вставить("СогласованиеЗавершено", Ложь);
	СтруктураДанных.Вставить("ПроводитьДокумент", Ложь);
	СтруктураДанных.Вставить("ШаблонСообщенияЭлектроннойПочты", Неопределено);
	СтруктураДанных.Вставить("ЗапретитьРедактирование", Ложь);
	СтруктураДанных.Вставить("РазрешитьПометкуНаУдаление", Ложь);
	СтруктураДанных.Вставить("НеОтображатьВСпискеЗадач", Ложь);
	#Вставка
	СтруктураДанных.Вставить("ПроводитьАвтоматически", Ложь);
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	торо_НастройкиСтатусовСогласованияДокументов.Начальный КАК Начальный,
	|	торо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено КАК СогласованиеЗавершено,
	|	торо_НастройкиСтатусовСогласованияДокументов.ПроводитьДокумент КАК ПроводитьДокумент,
	|	торо_НастройкиСтатусовСогласованияДокументов.ШаблонСообщенияЭлектроннойПочты КАК ШаблонСообщенияЭлектроннойПочты,
	|	торо_НастройкиСтатусовСогласованияДокументов.ЗапретитьРедактирование КАК ЗапретитьРедактирование,
	|	торо_НастройкиСтатусовСогласованияДокументов.РазрешитьПометкуНаУдаление КАК РазрешитьПометкуНаУдаление,
	#Вставка
	|	торо_НастройкиСтатусовСогласованияДокументов.гкс_ПроводитьАвтоматически КАК ПроводитьАвтоматически,
	// гкс+ [Релиз16] Деснол
	|	торо_НастройкиСтатусовСогласованияДокументов.гкс_РазрешеноСоздаватьПодчиненные КАК гкс_РазрешеноСоздаватьПодчиненные,
	// гкс- [Релиз16]
	#КонецВставки
	|	торо_НастройкиСтатусовСогласованияДокументов.НеОтображатьВСпискеЗадач КАК НеОтображатьВСпискеЗадач
	|ИЗ
	|	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|ГДЕ
	|	торо_НастройкиСтатусовСогласованияДокументов.Статус = &ТекущийСтатус
	|	И торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования";

	Запрос.УстановитьПараметр("ТекущийСтатус", СтатусДокумента);
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции

&ИзменениеИКонтроль("ЗавершитьУтверждениеСтатусаДокумента")
Процедура Расш_гкс_ЗавершитьУтверждениеСтатусаДокумента(Форма, ПараметрыОповещения)

	Объект = Форма.Объект;
	ВыбранныйСтатус = ПараметрыОповещения.ВыбранныйСтатус;
	#Вставка
	// Гкс+[TOIR20-160] Селимов
	ИсходныйСтатус = Форма.СтатусДокументаРегистр;			 
	// гкс+ [06.23] Деснол 16.06.2023
	НужноДобавитьПФвДО = Ложь;
	// гкс- [06.23] Деснол 16.06.2023
	#КонецВставки

	Попытка

		СменитьСтатус = НужноИзменитьСтатусДокумента(Форма, ВыбранныйСтатус);
		#Вставка
		Если СменитьСтатус = Ложь И ПараметрыОповещения.Свойство("УстановитьПринудительно")
			И ПараметрыОповещения.УстановитьПринудительно = Истина Тогда 
			СменитьСтатус = Истина;
		КонецЕсли;
		#КонецВставки

		СтруктураПараметров = Новый Структура;
		Если СменитьСтатус Тогда

			Форма.СтатусДокументаРегистр = ВыбранныйСтатус;
			Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
				Объект.СтатусДокумента = Форма.СтатусДокументаРегистр;
			КонецЕсли;

			ПроводитьДокумент = Ложь;
			СтруктураДанных = ПолучитьДанныеПоСтатусуДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
			ПроводитьДокумент = СтруктураДанных.ПроводитьДокумент;

			#Удаление
			Если ПроводитьДокумент И Объект.Проведен Тогда
			#КонецУдаления
			#Вставка
			Если ПроводитьДокумент И (Объект.Проведен
				ИЛИ (СтруктураДанных.ПроводитьАвтоматически = Истина И Объект.Проведен = Ложь)) Тогда
			#КонецВставки
				СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
				СтруктураПараметров.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
			Иначе 
				СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			КонецЕсли;

		Иначе
			СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			#Вставка
			СтруктураДанных = Новый Структура("ПроводитьАвтоматически",Ложь);
			#КонецВставки
		КонецЕсли;
		#Вставка
		// гкс+ [05.23] Деснол 10.05.2023
		// Читаем чтобы восстановить после Отказа
		НаборДляЗаписи1 = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи1.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
	    НаборДляЗаписи1.Прочитать();
		// Запись таблицы ИсторияСтатусов.
		НаборДляЗаписи2 = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи2.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
        НаборДляЗаписи2.Прочитать();
		// Запись текущего статуса документа.
		НаборДляЗаписи3 = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи3.Отбор.СогласуемыйДокумент.Установить(Объект.Ссылка);
		НаборДляЗаписи3.Прочитать();
		// Нужно установить статусы до проведения, потомучто есть подписки
		ЗаписатьРегистрыСогласования(Форма);
		// гкс- [05.23] Деснол 10.05.2023
		#КонецВставки

		#Удаление
		ЗаписатьРегистрыСогласования(Форма);
		#КонецУдаления
		#Удаление
		Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
		#КонецУдаления
		#Вставка 
		Если Форма.мХранитьИсториюСогласованияВДокументах 
			ИЛИ СтруктураДанных.ПроводитьАвтоматически = Истина Тогда
		#КонецВставки
			Форма.Записать(СтруктураПараметров);
		КонецЕсли;

		#Вставка
		// гкс+ [06.23] Деснол 16.06.2023
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
			Настройка = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.СтатусыЗаявокКВыгрузке;
			МассивСвойств = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.ПолучитьСвойства(Настройка, "Свойства");
			Для каждого Свойство Из МассивСвойств Цикл
				Если Свойство.Значение = ВыбранныйСтатус Тогда 
					НужноДобавитьПФвДО = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// гкс- [06.23] Деснол 16.06.2023
		// гкс+ [05.23] Деснол 10.05.2023
		//// Гкс+[TOIR20-160] Селимов
		//ЗаписатьРегистрыСогласования(Форма); 
		// гкс- [05.23] Деснол 10.05.2023
		#КонецВставки
		ДобавитьНапоминанияПоСтатусамСогласования(Объект.Ссылка);
		ОбновитьДеревоСогласующих(Форма);

		торо_РаботаССогласованиямиКлиентСервер.УстановитьВидимостьСогласованиеИУтверждение(Форма.мИспользоватьСогласованиеДокументов, Объект, Форма);

	Исключение
		#Вставка
		// гкс+ [06.23] Деснол 16.06.2023
		НужноДобавитьПФвДО = Ложь;
		// гкс- [06.23] Деснол 16.06.2023
		// гкс+ [05.23] Деснол 10.05.2023
		НаборДляЗаписи1.Записать();
		НаборДляЗаписи2.Записать();
		НаборДляЗаписи3.Записать();
		// гкс- [05.23] Деснол 10.05.2023
		// Гкс+[TOIR20-160]
		Форма.СтатусДокументаРегистр = ИсходныйСтатус;
		Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
			Объект.СтатусДокумента = Форма.СтатусДокументаРегистр;
		КонецЕсли;
		КолВоСтатустов = Форма.ИсторияСтатусовРегистр.Количество();
		Если КолВоСтатустов > 0 
			И Форма.ИсторияСтатусовРегистр[КолВоСтатустов - 1].СтатусДокумента = ВыбранныйСтатус 
			И ВыбранныйСтатус <> ИсходныйСтатус Тогда
			ТекПользователь = Форма.ИсторияСтатусовРегистр[КолВоСтатустов - 1].Пользователь;
			// отмена добавленной записи на форме в ИсторияСтатусов
			Форма.ИсторияСтатусовРегистр.Удалить(КолВоСтатустов - 1);						
			// отмена установленных флагов "согласовано" на форме в ДеревоСогласования
			СнятьГалочкиЗаТекущегоПользователя(ВыбранныйСтатус, Форма, ТекПользователь);
		КонецЕсли; 
		#КонецВставки 
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,, ОписаниеОшибки);
	КонецПопытки;
	#Вставка
	// гкс+ [06.23] Деснол 16.06.2023
	Если НужноДобавитьПФвДО Тогда 
		Попытка
			Документы.торо_ЗаявкаНаРемонт.гкс_ДобавитьПФТехЗаданияВДО(Объект.Ссылка, Истина);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,, ОписаниеОшибки);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	// гкс- [06.23] Деснол 16.06.2023
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(ЭтаФорма, ВидДокумента, Регламентный)

	ЭтаФорма.мХранитьИсториюСогласованияВДокументах = Константы.торо_ХранитьИсториюСогласованияВДокументах.Получить();
	ЭтаФорма.мИспользоватьСогласованиеДокументов = ПроверитьИспользованиеСогласованияДокументов(ВидДокумента, Регламентный);

	ОписаниеРевизита = Новый РеквизитФормы("СогласованиеТолькоПросмотр", Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ОписаниеРевизита);
	#Вставка
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ПериодЧП", Новый ОписаниеТипов("Дата",,,,,
		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)), "ИсторияСтатусовРегистр"));
	#КонецВставки
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#Вставка
	Для Каждого ЭлементФормы Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") И ЭлементФормы.ПутьКДанным = "ИсторияСтатусовРегистр" Тогда 
			Для Каждого ПодчиненныйЭлемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
				Если ПодчиненныйЭлемент.ПутьКДанным = "ИсторияСтатусовРегистр.Период" Тогда 
					НЭлем = ЭтаФорма.Элементы.Добавить("гкс_ПериодЧП", Тип("ПолеФормы"), ЭлементФормы);
					НЭлем.Заголовок = ПодчиненныйЭлемент.Заголовок;
					НЭлем.Вид = ВидПоляФормы.ПолеВвода;
					НЭлем.ТолькоПросмотр = Истина;
					НЭлем.ПутьКДанным = "ИсторияСтатусовРегистр.гкс_ПериодЧП";
					ЭтаФорма.Элементы.Переместить(НЭлем, ЭлементФормы, ПодчиненныйЭлемент);
					ПодчиненныйЭлемент.Видимость = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	#КонецВставки

	Если ЭтаФорма.мИспользоватьСогласованиеДокументов Тогда

		Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда

			Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.СпособСогласования) Тогда
				#Вставка
				Если ВидДокумента = 
						Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты Тогда 
						Если ЭтаФорма.Объект.СписокДефектов.Количество() > 0 Тогда 
							ЭтаФорма.Объект.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
					ВидДокумента, ЭтаФорма.Объект.Организация, ЭтаФорма.Объект.СписокДефектов[0].ОтказавшийЭлемент.Подразделение, ЭтаФорма.Объект.ПодразделениеИсполнитель);
						Иначе
							ЭтаФорма.Объект.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
					ВидДокумента, ЭтаФорма.Объект.Организация, ЭтаФорма.Объект.Подразделение, ЭтаФорма.Объект.ПодразделениеИсполнитель);
						КонецЕсли;
				ИначеЕсли (ВидДокумента = 
						Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт)
						ИЛИ (ВидДокумента = 
						Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот) Тогда 
					ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
					//
					Если ЭтаФорма.Объект.ИсполнителиПоРемонтам.Количество() И
						ТипЗнч(ЭтаФорма.Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
						ПодразделениеИсполнитель = ЭтаФорма.Объект.ИсполнителиПоРемонтам[0].Исполнитель;
					КонецЕсли;
					//
					ЭтаФорма.Объект.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
						ВидДокумента, ЭтаФорма.Объект.Организация, ЭтаФорма.Объект.Подразделение, ПодразделениеИсполнитель);
				Иначе
				#КонецВставки
				ЭтаФорма.Объект.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(ВидДокумента, ЭтаФорма.Объект.Организация, ЭтаФорма.Объект.Подразделение);
				#Вставка
				КонецЕсли;
				#КонецВставки
			КонецЕсли;

			ЭтаФорма.СтатусДокументаРегистр = ПолучитьНачальныйСтатус(ЭтаФорма.Объект.СпособСогласования);
			Если ЭтаФорма.мХранитьИсториюСогласованияВДокументах Тогда
				ЭтаФорма.Объект.СтатусДокумента = ЭтаФорма.СтатусДокументаРегистр;
			КонецЕсли;

			торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, ЭтаФорма.СтатусДокументаРегистр);

		Иначе

			ЭтаФорма.СтатусДокументаРегистр = ПолучитьТекущийСтатусСогласованияДокумента(ЭтаФорма.Объект.Ссылка);
			ПрочитатьРегистрыСогласования(ЭтаФорма);

		КонецЕсли;

		ОбновитьДеревоСогласующих(ЭтаФорма);

	КонецЕсли;

	торо_РаботаССогласованиямиКлиентСервер.УстановитьВидимостьСогласованиеИУтверждение(ЭтаФорма.мИспользоватьСогласованиеДокументов, ЭтаФорма.Объект, ЭтаФорма);

КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписиНаСервере")
Процедура гкс_ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	#Вставка
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("гкс_НазначитьСтатусДокумента") Тогда   
		СпособСогласования = ТекущийОбъект.СпособСогласования;	
		СтатусДокумента = торо_РаботаССогласованиямиПовтИсп.ПолучитьНачальныйСтатус(СпособСогласования);
		Если Не ЗначениеЗаполнено(СтатусДокумента) Тогда
			Возврат;
		КонецЕсли;
								
		ЭтаФорма.СтатусДокументаРегистр = СтатусДокумента;
	
		Объект = ЭтаФорма.Объект;
	
		НаборЗаписей = ЭтаФорма.РеквизитФормыВЗначение("ИсторияСтатусовРегистр");
		НаборЗаписей.Отбор.СогласуемыйДокумент.Установить(ТекущийОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		ЭтаФорма.ЗначениеВреквизитФормы(НаборЗаписей, "ИсторияСтатусовРегистр");
				
		СогласующиеРегистр = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
		ДеревоСогласования = ПолучитьДеревоСогласования(
			СпособСогласования, СтатусДокумента, СогласующиеРегистр.Выгрузить());
	
		ЭтаФорма.ЗначениеВРеквизитФормы(ДеревоСогласования,"ДеревоСогласования");
		ЭтаФорма.Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(СпособСогласования);
			
		Возврат;		
	КонецЕсли;
	#КонецВставки
	
	Если ЭтаФорма.мИспользоватьСогласованиеДокументов Тогда
		торо_РаботаССогласованиямиКлиентСервер.ЗаписатьДеревоСогласования(ЭтаФорма);
		Если ЭтаФорма.СтатусДокументаРегистр = ПолучитьНачальныйСтатус(ТекущийОбъект.СпособСогласования) Тогда
			ЗаписатьРегистрыСогласования(ЭтаФорма, ТекущийОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&После("ПрочитатьРегистрыСогласования")
Процедура Расш_гкс_ПрочитатьРегистрыСогласования(Форма)
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	//СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	//ЗаполнитьЗначенияСвойств(СтруктураПроверки, Форма);
	//Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено И НЕ СтруктураПроверки.гкс_СдвигЧП = 0 Тогда 
		Для Каждого СтрокаТаблицы Из Форма.ИсторияСтатусовРегистр Цикл
			СтрокаТаблицы.гкс_ПериодЧП = СтрокаТаблицы.Период + (СдвигЧП * 3600);
		КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("торо_СогласованиеОбработкаЗаполненияОбработчик")
Процедура Расш_гкс_торо_СогласованиеОбработкаЗаполненияОбработчик(Источник)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Источник.СпособСогласования) Тогда
		СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);

		Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
			Возврат;
		КонецЕсли;

		#Вставка
		Если СтруктураПараметров.ВидДокументаЗначение = 
				Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты Тогда 
			Если Источник.СписокДефектов.Количество() > 0 Тогда 
				Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
					СтруктураПараметров.ВидДокументаЗначение, Источник.Организация,
					Источник.СписокДефектов[0].ОтказавшийЭлемент.Подразделение, Источник.ПодразделениеИсполнитель);
			Иначе
				Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
					СтруктураПараметров.ВидДокументаЗначение, Источник.Организация,
					Источник.Подразделение, Источник.ПодразделениеИсполнитель);
			КонецЕсли;
		ИначеЕсли СтруктураПараметров.ВидДокументаЗначение = 
				Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт
				ИЛИ СтруктураПараметров.ВидДокументаЗначение = 
				Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот Тогда 
			ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
			//
			Если Источник.ИсполнителиПоРемонтам.Количество() И
				ТипЗнч(Источник.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
				ПодразделениеИсполнитель = Источник.ИсполнителиПоРемонтам[0].Исполнитель;
			КонецЕсли;
			//
			Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
				СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение, ПодразделениеИсполнитель);
		Иначе
		#КонецВставки
		Источник.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение);
		#Вставка
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

// Функция устанавливает способ согласования для вида документов.
//
// Параметры:
//  ВидДокумента - ПеречислениеСсылка.торо_ВидыДокументовСогласованияРемонтов - вид документа.
//  Организация - СправочникСылка.Организации - организация документа.
//  ПодразделениеОрганизации - СправочникСсылка.СтруктураПредприятия - подразделение документа.
//  ПодразделениеИсполнитель - СправочникСсылка.СтруктураПредприятия - подразделение исполнитель.
//
// Возвращаемое значение:
//  СправочникСсылка.торо_СпособыСогласованияДокументов - способ согласования по умолчанию.
//
Функция гкс_ПолучитьСпособСогласованияПоУмолчанию(ВидДокумента,Организация, ПодразделениеОрганизации, ПодразделениеИсполнитель) Экспорт		
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	              |	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента КАК ВидДокумента,
	              |	торо_НастройкиСогласованияДокументовТОиР.Организация КАК Организация,
	              |	торо_НастройкиСогласованияДокументовТОиР.Подразделение КАК Подразделение,
	              |	торо_НастройкиСогласованияДокументовТОиР.СпособСогласования КАК СпособСогласования,
	              |	ВЫБОР
	              |		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	              |				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	              |				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = &Подразделение
	              |				И торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель = &ПодразделениеИсп
	              |			ТОГДА 1
	              |		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	              |				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	              |				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |				И торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель = &ПодразделениеИсп
	              |			ТОГДА 2
				  |		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	              |				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	              |				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = &Подразделение
	              |				И торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |			ТОГДА 2
	              |		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	              |				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	              |				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |				И торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |			ТОГДА 3
	              |		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	              |				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |				И торо_НастройкиСогласованияДокументовТОиР.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	              |				И торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	              |			ТОГДА 4
	              |		ИНАЧЕ 5
	              |	КОНЕЦ КАК Приоритет
	              |ИЗ
	              |	РегистрСведений.торо_НастройкиСогласованияДокументовТОиР КАК торо_НастройкиСогласованияДокументовТОиР
	              |ГДЕ
	              |	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
				  |	И торо_НастройкиСогласованияДокументовТОиР.СпособСогласования.ПометкаУдаления = Ложь
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Приоритет,
	              |	Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ПодразделениеИсп", ПодразделениеИсполнитель);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	// гкс+ [разработка 2021] Куст 05.05.2021
	//Если ВыборкаДетальныеЗаписи.Следующий() И НЕ ВыборкаДетальныеЗаписи.Приоритет = 4 Тогда
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Приоритет = 1 Тогда
	// гкс- [разработка 2021] Куст 05.05.2021
		СпособСогласования = ВыборкаДетальныеЗаписи.СпособСогласования;
	Иначе
		// гкс+ [разработка 2021] Куст 05.05.2021
		//СпособСогласования = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
		СпособСогласования = Неопределено;
		// гкс- [разработка 2021] Куст 05.05.2021
	КонецЕсли;
	
	Возврат СпособСогласования;
	
КонецФункции

&ИзменениеИКонтроль("торо_СогласованиеПриКопированииДокументаПриКопировании")
Процедура Расш_гкс_торо_СогласованиеПриКопированииДокументаПриКопировании(Источник, ОбъектКопирования)

	Источник.СтатусДокумента    = Неопределено;
	Источник.СпособСогласования = Неопределено;
	Источник.ИсторияСтатусов.Очистить();
	Источник.Согласующие.Очистить();

	СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);
	Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
		Возврат;
	КонецЕсли;

	#Вставка
	Если СтруктураПараметров.ВидДокументаЗначение = 
			Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты Тогда 
		Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
			СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение, Источник.ПодразделениеИсполнитель);
	ИначеЕсли СтруктураПараметров.ВидДокументаЗначение = 
			Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт
			ИЛИ СтруктураПараметров.ВидДокументаЗначение = 
			Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот Тогда 
		ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
		//
		Если Источник.ИсполнителиПоРемонтам.Количество() И
			ТипЗнч(Источник.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			ПодразделениеИсполнитель = Источник.ИсполнителиПоРемонтам[0].Исполнитель;
		КонецЕсли;
		//
		Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
			СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение, ПодразделениеИсполнитель);
	ИначеЕсли СтруктураПараметров.ВидДокументаЗначение = 
			Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот Тогда 
		ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
		//
		Для Каждого СтрокаТаблицы Из Источник.ОбследованноеОборудование Цикл
			Если ТипЗнч(СтрокаТаблицы.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
				ПодразделениеИсполнитель = СтрокаТаблицы.Исполнитель;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//
		Источник.СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
			СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение, ПодразделениеИсполнитель);
	Иначе
	#КонецВставки
	Источник.СпособСогласования = ПолучитьСпособСогласованияПоУмолчанию(СтруктураПараметров.ВидДокументаЗначение, Источник.Организация, Источник.Подразделение);
	#Вставка
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьСпособСогласованияПоУмолчанию")
Функция Расш_гкс_ПолучитьСпособСогласованияПоУмолчанию(ВидДокумента, Организация, ПодразделениеОрганизации)

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента,
	|	торо_НастройкиСогласованияДокументовТОиР.Организация КАК Организация,
	|	торо_НастройкиСогласованияДокументовТОиР.Подразделение,
	|	торо_НастройкиСогласованияДокументовТОиР.СпособСогласования,
	|	ВЫБОР
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = &Подразделение
	|			ТОГДА 1
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = &Организация
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	|				И торо_НастройкиСогласованияДокументовТОиР.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				И торо_НастройкиСогласованияДокументовТОиР.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.торо_НастройкиСогласованияДокументовТОиР КАК торо_НастройкиСогласованияДокументовТОиР
	|ГДЕ
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента = &ВидДокумента
	#Вставка
	|	И торо_НастройкиСогласованияДокументовТОиР.СпособСогласования.ПометкаУдаления = Ложь
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Организация";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() И НЕ ВыборкаДетальныеЗаписи.Приоритет = 4 Тогда
		СпособСогласования = ВыборкаДетальныеЗаписи.СпособСогласования;
	Иначе

		СпособСогласования = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();

	КонецЕсли;

	Возврат СпособСогласования;

КонецФункции

&ИзменениеИКонтроль("торо_СогласованиеПроверкиПередЗаписьюДокументаОбработчик")
Процедура гкс_торо_СогласованиеПроверкиПередЗаписьюДокументаОбработчик(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		#Вставка
        гкс_ДобавитьСпособСогласованияДляНовыхДокументов(Источник, Отказ);		
		#КонецВставки
		Возврат;
	КонецЕсли;

	СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);

	Если НЕ СтруктураПараметров.ИспользоватьСогласование Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("Согласование_ВидДокумента", СтруктураПараметров.ВидДокументаМетаданные);
	ДополнительныеСвойства.Вставить("Согласование_Регламентный", СтруктураПараметров.Регламентный);
	ДополнительныеСвойства.Вставить("ИспользоватьСогласование",  СтруктураПараметров.ИспользоватьСогласование);

	// Если документ новый, то в регистре данных еще не будет,
	// но в ДополнительныеСвойства будет статус с формы документа.
	Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
	ИначеЕсли НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		// Документ записывается через код без открытия формы.
		// Следует выполнить установку начального статуса.
		СтатусДокумента = ПолучитьНачальныйСтатус(Источник.СпособСогласования);
		ЗаполнитьСвойстваДокументаПередЗаписьюБезОткрытияФормы(Источник, СтатусДокумента);
	Иначе
		СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(Источник.Ссылка);
	КонецЕсли;

	ДополнительныеСвойства.Вставить("СтатусДокумента", СтатусДокумента);

	// Проверить разрешение на пометку удаления
	Если Источник.ПометкаУдаления Тогда
		ПроверитьРазрешениеНаПометкуУдаленияПередЗаписьюДокумента(Источник.СпособСогласования, СтатусДокумента, Источник.ПометкаУдаления, Источник.Ссылка.ПометкаУдаления, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Проверить, можно ли проводить документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьРазрешениеПроведенияПоСтатусу(Источник.СпособСогласования, ДополнительныеСвойства, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Источник.Организация <> Источник.Ссылка.Организация Тогда
		ДополнительныеСвойства.Вставить("ИзмениласьОрганизация", Истина);
	КонецЕсли;
	
	#Вставка
	Если Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("ИзмениласьПометкаУдаления", Истина);		
	КонецЕсли;
	#КонецВставки
	#Вставка
	гкс_ДобавитьСпособСогласованияДляНовыхДокументов(Источник, Отказ);
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("торо_СогласованиеПриЗаписиДокументаПриЗаписи")
Процедура гкс_торо_СогласованиеПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		#Вставка
		гкс_НазначитьТекущийСтатусДляНовогоДокумента(Источник, Отказ); 
		#КонецВставки
		Возврат;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства = Источник.ДополнительныеСвойства;

	Если НЕ ДополнительныеСвойства.Свойство("ИспользоватьСогласование") ИЛИ ДополнительныеСвойства.ИспользоватьСогласование <> Истина Тогда
		Возврат;
	КонецЕсли;

	СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;

	#Удаление
	Если ЗначениеЗаполнено(Источник.СпособСогласования)
		И (СтатусДокумента = ПолучитьНачальныйСтатус(Источник.СпособСогласования)
		ИЛИ ДополнительныеСвойства.Свойство("ИзмениласьОрганизация"))	Тогда
		ДобавитьНапоминанияПоСтатусамСогласования(Источник.Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	Если ЗначениеЗаполнено(Источник.СпособСогласования)
		И (СтатусДокумента = ПолучитьНачальныйСтатус(Источник.СпособСогласования)
		Или ДополнительныеСвойства.Свойство("ИзмениласьОрганизация") 
		Или ДополнительныеСвойства.Свойство("ИзмениласьПометкаУдаления")) Тогда
		
		ДобавитьНапоминанияПоСтатусамСогласования(Источник.Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	#КонецВставки

	Если ДополнительныеСвойства.Свойство("Записать_СтатусДокумента") Тогда
		МенеджерЗаписи = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СогласуемыйДокумент = Источник.Ссылка;
		МенеджерЗаписи.СтатусДокумента = СтатусДокумента;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Записать_ИсторияСтатусовСогласования") Тогда
		НаборДляЗаписи = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Источник.Ссылка);
		Для каждого Строка из ДополнительныеСвойства.ИсторияСтатусовСогласования Цикл
			НоваяСтрока = НаборДляЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.СогласуемыйДокумент = Источник.Ссылка;
		КонецЦикла;
		НаборДляЗаписи.Записать(Истина);
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Записать_Согласующие") Тогда
		НаборДляЗаписи = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
		НаборДляЗаписи.Отбор.СогласуемыйДокумент.Установить(Источник.Ссылка);
		Для каждого Строка из ДополнительныеСвойства.Согласующие Цикл
			НоваяСтрока = НаборДляЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.СогласуемыйДокумент = Источник.Ссылка;
		КонецЦикла;
		НаборДляЗаписи.Записать(Истина);
	КонецЕсли;
	#Вставка
	гкс_НазначитьТекущийСтатусДляНовогоДокумента(Источник, Отказ); 
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ДобавитьНапоминанияПоСтатусамСогласования")
Процедура гкс_ДобавитьНапоминанияПоСтатусамСогласования(СсылкаНаДокумент, ДополнительныеСвойства)
	
	#Вставка
	МенеджерСтатусыСогласованияДокументов = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот;
	
	НаборЗаписейСогласования = МенеджерСтатусыСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСогласования.Отбор.СогласуемыйДокумент.Установить(СсылкаНаДокумент);
	НаборЗаписейСогласования.Записать();
	
	Реквизиты = гкс_ЗначенияПроверяемыхРеквизитовДокументаСогласования(СсылкаНаДокумент);
	
	Если Реквизиты.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	СпособСогласования 	= Реквизиты.СпособСогласования;
	Подразделение		= Реквизиты.Подразделение;      	
	#КонецВставки
	// Дополнительные свойства заполняются на форме перед записью документа.
	// В регистрах информация на этот момент может быть устаревшая, т.к.
	// событие ПриЗаписи в форме документа (когда выполняется запись в регистры)
	// срабатывает после событий ПриЗаписи и ОбработкаПроведения в модуле объекта.
	// Но если запись выполнялась не из формы, то берем, что есть в регистрах.
	Если ДополнительныеСвойства <> Неопределено Тогда

		Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
			СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
		Иначе
			СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(СсылкаНаДокумент);
		КонецЕсли;

		Если ДополнительныеСвойства.Свойство("Согласующие") Тогда
			СогласующиеДокумента = ДополнительныеСвойства.Согласующие;
		Иначе
			СогласующиеДокумента = ПолучитьТаблицуСогласующихДокумента(СсылкаНаДокумент);
		КонецЕсли;

	Иначе
		СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(СсылкаНаДокумент);
		СогласующиеДокумента = ПолучитьТаблицуСогласующихДокумента(СсылкаНаДокумент);
	КонецЕсли;
	
	#Удаление
	ДеревоСогласования = ПолучитьДеревоСогласования(СсылкаНаДокумент.СпособСогласования, СтатусДокумента, СогласующиеДокумента);
	#КонецУдаления
	#Вставка
	ДеревоСогласования = ПолучитьДеревоСогласования(СпособСогласования, СтатусДокумента, СогласующиеДокумента);
	#КонецВставки	
	ТаблицаСогласующих = ПодготовитьТаблицуНапоминанийДляСогласующих(ДеревоСогласования);
	#Удаление
	НаборЗаписейСогласования = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписейСогласования.Отбор.СогласуемыйДокумент.Установить(СсылкаНаДокумент);
	НаборЗаписейСогласования.Записать();
	#КонецУдаления
	
	НаборЗаписейСогласования.Отбор.Статус.Установить(СтатусДокумента);
	#Удаление
	НаборЗаписейСогласования.Отбор.Организация.Установить(СсылкаНаДокумент.Организация);
	#КонецУдаления
	#Вставка
	НаборЗаписейСогласования.Отбор.Организация.Установить(Реквизиты.Организация);
	#КонецВставки
	Для Каждого СтрокаТЗ Из ТаблицаСогласующих Цикл
		НоваяЗапись = НаборЗаписейСогласования.Добавить();
		#Удаление
		НоваяЗапись.Организация  = СсылкаНаДокумент.Организация;
		#КонецУдаления
		#Вставка
		НоваяЗапись.Организация  = Реквизиты.Организация;
		#КонецВставки
		НоваяЗапись.СогласуемыйДокумент     = СсылкаНаДокумент;
		НоваяЗапись.Пользователь = СтрокаТЗ.Согласующий;
		НоваяЗапись.Статус       = СтатусДокумента;
		НоваяЗапись.НеНапоминать = СтрокаТЗ.НеНапоминать;
		НоваяЗапись.Дата         = СтрокаТЗ.Дата;
		#Вставка
		НоваяЗапись.СпособСогласования 	= СпособСогласования;		
		НоваяЗапись.Подразделение		= Подразделение;       		
		#КонецВставки
	КонецЦикла;

	НаборЗаписейСогласования.Записать();

КонецПроцедуры


&ИзменениеИКонтроль("ПолучитьДеревоСогласования")
Функция гкс_ПолучитьДеревоСогласования(СпособСогласования, СтатусДокумента, ТаблицаСогласовавших)

	#Вставка
	ВыборкаПорядокСогласования 	= Неопределено;
    ВыборкаЗамещающие			= Неопределено;
	
	Если ЗначениеЗаполнено(СпособСогласования) Тогда
		ТекстПолей = "ПорядокСогласования, Замещающие";
		ДанныеСпособа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СпособСогласования, ТекстПолей);
		ВыборкаПорядокСогласования 	= ДанныеСпособа.ПорядокСогласования.Выбрать();
		ВыборкаЗамещающие			= ДанныеСпособа.Замещающие.Выбрать();	
	КонецЕсли;
			
	Уровень1 = 1;
	Уровень2 = 2;
	#КонецВставки

	ДеревоСогласования = Новый ДеревоЗначений;
	ДеревоСогласования.Колонки.Добавить("СтатусДокумента", Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"));
	ДеревоСогласования.Колонки.Добавить("Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ДеревоСогласования.Колонки.Добавить("Замещающий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ДеревоСогласования.Колонки.Добавить("Согласовано", Новый ОписаниеТипов("Булево"));
	ДеревоСогласования.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	ДеревоСогласования.Колонки.Добавить("Начальный", Новый ОписаниеТипов("Булево"));

	// Создадим строки дерева согласования.
	СписокСледующихСтатусов = ПолучитьСписокСледующихСтатусовДокументаДетально(СпособСогласования, СтатусДокумента);
	Для Каждого ЭлементСписка из СписокСледующихСтатусов Цикл

		СтрокаСтатус = ДеревоСогласования.Строки.Добавить();
		СтрокаСтатус.СтатусДокумента = ЭлементСписка.Значение.СледующийСтатус;
		СтрокаСтатус.Уровень         = 0;
		СтрокаСтатус.Начальный = ЭлементСписка.Значение.Начальный;
		
		#Удаление
		МассивПользователей = СпособСогласования.ПорядокСогласования.НайтиСтроки(Новый Структура("ТекущийСтатус", ЭлементСписка.Значение.СледующийСтатус));
		
		Для Каждого ЭлементМассива Из МассивПользователей Цикл

			СтрокаСогласующий = СтрокаСтатус.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСогласующий, СтрокаСтатус);
			СтрокаСогласующий.Согласующий = ЭлементМассива.Пользователь;
			СтрокаСогласующий.Уровень     = 1;

			МассивЗамещающих = СпособСогласования.Замещающие.НайтиСтроки(Новый Структура("Пользователь, ТекущийСтатус", ЭлементМассива.Пользователь, ЭлементМассива.ТекущийСтатус));
			Для Каждого ЭлементМассиваЗамов Из МассивЗамещающих Цикл

				СтрокаЗамещающий = СтрокаСогласующий.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗамещающий, СтрокаСогласующий);
				СтрокаЗамещающий.Замещающий = ЭлементМассиваЗамов.Замещающий;
				СтрокаЗамещающий.Уровень    = 2;
			КонецЦикла;

		КонецЦикла;
		#КонецУдаления
		#Вставка		
		Если ВыборкаПорядокСогласования = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Пока ВыборкаПорядокСогласования.НайтиСледующий(ЭлементСписка.Значение.СледующийСтатус, "ТекущийСтатус") Цикл
			СтрокаСогласующий = СтрокаСтатус.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСогласующий, СтрокаСтатус);
			СтрокаСогласующий.Согласующий = ВыборкаПорядокСогласования.Пользователь;
			СтрокаСогласующий.Уровень     = Уровень1;
						
			Если ВыборкаЗамещающие = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Пользователь", 	ВыборкаПорядокСогласования.Пользователь);
			СтруктураОтбора.Вставить("ТекущийСтатус", 	ВыборкаПорядокСогласования.ТекущийСтатус);
			
			Пока ВыборкаЗамещающие.НайтиСледующий(СтруктураОтбора) Цикл
				СтрокаЗамещающий = СтрокаСогласующий.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗамещающий, СтрокаСогласующий);
				СтрокаЗамещающий.Замещающий = ВыборкаЗамещающие.Замещающий;
				СтрокаЗамещающий.Уровень    = Уровень2;	
			КонецЦикла;					
		КонецЦикла;		
		#КонецВставки
	КонецЦикла;

	ПроставитьФлагиСогласованоВДереве(ДеревоСогласования, СписокСледующихСтатусов, ТаблицаСогласовавших);

	Возврат ДеревоСогласования;

КонецФункции


Функция гкс_ЗначенияПроверяемыхРеквизитовДокументаСогласования(СсылкаНаДокумент)

	ОбщийМодуль		= ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначения");
	ОбщийМодульКС 	= ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	ЕстьВсеРеквизиты = Истина;
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Организация");
	МассивРеквизитов.Добавить("СпособСогласования");
	МассивРеквизитов.Добавить("Подразделение");
	МассивРеквизитов.Добавить("ПометкаУдаления");
	
	Результат = Новый Структура;
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		Результат.Вставить(ИмяРеквизита, Неопределено);
		
		Если ИмяРеквизита = "ПометкаУдаления" Тогда
			Результат[ИмяРеквизита] = Ложь;	
		КонецЕсли;
		
		ЕстьТекущийРеквизит = ОбщийМодульКС.ЕстьРеквизитИлиСвойствоОбъекта(СсылкаНаДокумент, ИмяРеквизита);
		
		Если Не ЕстьТекущийРеквизит Тогда
			ЕстьВсеРеквизиты = Ложь;	
		КонецЕсли;
	КонецЦикла;	
	
	Если ЕстьВсеРеквизиты Тогда		
		Результат = ОбщийМодуль.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, МассивРеквизитов);			 
	Иначе							
		Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
			ЕстьТекущийРеквизит = ОбщийМодульКС.ЕстьРеквизитИлиСвойствоОбъекта(СсылкаНаДокумент, ИмяРеквизита);
			
			Если ЕстьТекущийРеквизит Тогда
				Результат[ИмяРеквизита] = ОбщийМодуль.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, ИмяРеквизита);		
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	 
КонецФункции


&ИзменениеИКонтроль("ПодготовитьТаблицуНапоминанийДляСогласующих")
Функция гкс_ПодготовитьТаблицуНапоминанийДляСогласующих(ДеревоСогласования)
	
	#Вставка
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	#КонецВставки
	ТаблицаСогласующих = Новый ТаблицаЗначений;
	ТаблицаСогласующих.Колонки.Добавить("Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));

	Для Каждого СтрокаСтатусов Из ДеревоСогласования.Строки Цикл
		Для Каждого СтрокаСогласующих Из СтрокаСтатусов.Строки Цикл
			НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
			НовСтрокаТЗ.Согласующий = СтрокаСогласующих.Согласующий;

			Для Каждого СтрокаЗамещающих Из СтрокаСогласующих.Строки Цикл
				НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
				НовСтрокаТЗ.Согласующий = СтрокаЗамещающих.Замещающий;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТаблицаСогласующих.Свернуть("Согласующий");
	ТаблицаСогласующих.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаСогласующих.Колонки.Добавить("НеНапоминать", Новый ОписаниеТипов("Булево"));

	Для Каждого СтрокаСогласующих Из ТаблицаСогласующих Цикл

		ОтключитьОповещение = Истина;

		// Этап 1 Проход по согласовавшим
		МассивСтрокСогласовавших = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Согласующий, Замещающий",
		СтрокаСогласующих.Согласующий, Справочники.Пользователи.ПустаяСсылка()), Истина);

		Для Каждого ЭлементМС Из МассивСтрокСогласовавших Цикл

			Если Не ЭлементМС.Согласовано Тогда

				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМС.Строки Цикл
					Если СтрокаЗамещения.Согласовано Тогда
						ЕстьСогласованные = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;

				Если Не ЕстьСогласованные Тогда
					ОтключитьОповещение = Ложь;
					Прервать;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Если Не ОтключитьОповещение Тогда
			Продолжить;
		КонецЕсли;

		// Этап №2 Проход по замещающим
		МассивСтрокЗамещающих = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Замещающий",
		СтрокаСогласующих.Согласующий), Истина);

		Для Каждого ЭлементМЗ Из МассивСтрокЗамещающих Цикл

			Если (Не ЭлементМЗ.Согласовано) И (Не ЭлементМЗ.Родитель.Согласовано) Тогда

				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМЗ.Родитель.Строки Цикл

					Если СтрокаЗамещения.Согласовано Тогда
						ЕстьСогласованные = Истина;
						Прервать;
					КонецЕсли;

				КонецЦикла;

				Если Не ЕстьСогласованные Тогда
					ОтключитьОповещение = Ложь;
					Прервать;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Если Не ОтключитьОповещение Тогда
			Продолжить;
		КонецЕсли;
		#Удаление
		СтрокаСогласующих.Дата = ТекущаяДата();
		#КонецУдаления
		#Вставка
		СтрокаСогласующих.Дата = ТекущаяДатаСеанса;
		#КонецВставки
		СтрокаСогласующих.НеНапоминать = Истина;

	КонецЦикла;

	Возврат ТаблицаСогласующих;

КонецФункции


&ИзменениеИКонтроль("ЗаполнитьСвойстваДокументаПередЗаписьюБезОткрытияФормы")
Процедура гкс_ЗаполнитьСвойстваДокументаПередЗаписьюБезОткрытияФормы(Источник, СтатусДокумента)

	Если НЕ ЗначениеЗаполнено(СтатусДокумента) Тогда
		Возврат;
	КонецЕсли;

	ХранитьИсториюСогласованияВДокументах = Константы.торо_ХранитьИсториюСогласованияВДокументах.Получить();
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	
	#Удаление
		ТекущаяДата = ТекущаяДата();
	#КонецУдаления
	#Вставка
	ТекущаяДата = ТекущаяДатаСеанса();
	#КонецВставки

	Если ХранитьИсториюСогласованияВДокументах Тогда
		Источник.СтатусДокумента = СтатусДокумента;

		НоваяЗаписьИС = Источник.ИсторияСтатусов.Добавить();
		
		НоваяЗаписьИС.Дата            = ТекущаяДата;
		НоваяЗаписьИС.Пользователь    = Пользователи.ТекущийПользователь();
		НоваяЗаписьИС.ЗаКого          = Неопределено;
		НоваяЗаписьИС.СтатусДокумента = СтатусДокумента;
	КонецЕсли;

	ИсторияСтатусовРегистр = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	НоваяЗаписьИС = ИсторияСтатусовРегистр.Добавить();
	НоваяЗаписьИС.Период          = ТекущаяДата;
	НоваяЗаписьИС.Пользователь    = Пользователи.ТекущийПользователь();
	НоваяЗаписьИС.ЗаКого          = Неопределено;
	НоваяЗаписьИС.СтатусДокумента = СтатусДокумента;

	СогласующиеРегистр = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
	ДеревоСогласования = ПолучитьДеревоСогласования(Источник.СпособСогласования, СтатусДокумента, СогласующиеРегистр.Выгрузить());

	МассивСогласованного = Новый Массив;
	ЗаполнитьМассивИзДереваЗначений(МассивСогласованного, ДеревоСогласования.Строки);

	Для Каждого ЭлементМассива Из МассивСогласованного Цикл
		Если ЭлементМассива.Согласовано Тогда
			ЗаполнитьЗначенияСвойств(СогласующиеРегистр.Добавить(), ЭлементМассива);
		КонецЕсли;
	КонецЦикла;

	ДополнительныеСвойства.Вставить("Записать_СтатусДокумента", Истина);
	ДополнительныеСвойства.Вставить("Записать_ИсторияСтатусовСогласования", Истина);
	ДополнительныеСвойства.Вставить("Записать_Согласующие", Истина);

	ДополнительныеСвойства.Вставить("ИсторияСтатусовСогласования", ИсторияСтатусовРегистр.Выгрузить());
	ДополнительныеСвойства.Вставить("Согласующие", СогласующиеРегистр.Выгрузить());

КонецПроцедуры

// Гкс+[TOIR20-160] 
Процедура СнятьГалочкиЗаТекущегоПользователя(ВыбранныйСтатус, Форма, ТекущийПользователь) 
	
	МассивСтрокСогласования = Новый Массив;
	МассивСтрокДереваСогласования = Новый Массив;			
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСтрокДереваСогласования, Форма.ДеревоСогласования.ПолучитьЭлементы());
	
	// отбор строк, где пользователь является согласующим
	Для каждого Строка Из МассивСтрокДереваСогласования Цикл
		Если (Строка.Согласующий = ТекущийПользователь)
			И Строка.Замещающий = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
			И Строка.Согласовано = Истина 
			Тогда
			МассивСтрокСогласования.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла; 
	
	// отбор строк, где пользователь является замещающим
	МассивСтрокЗамещения = Новый Массив;
	
	Для каждого Строка Из МассивСтрокДереваСогласования Цикл
		Если Строка.Замещающий  = ТекущийПользователь
			И Строка.Согласовано = Истина 
			Тогда
			МассивСтрокЗамещения.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла;
	
	// отбор строк, где пользователь является замещающим (но не согласующим при этом)
	МассивОсновнойНеЗамещающий = Новый Массив; 
	Для Каждого Строка Из МассивСтрокЗамещения Цикл
		Если Строка.Согласующий <> ТекущийПользователь Тогда
			МассивОсновнойНеЗамещающий.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	СогласующийИлиЗамещающий = Ложь;
	
	// Обработка строк, где пользователь является согласующим
	Попытка
		Для Каждого СтрокаДЗ Из МассивСтрокСогласования Цикл
			Для Каждого СтрокаДЗП Из СтрокаДЗ.ПолучитьЭлементы() Цикл
				СтрокаДЗП.Согласовано = Ложь;
			КонецЦикла; 
			
			СтрокаДЗ.Согласовано = (СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус);
			
			Если СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус Тогда
				СогласующийИлиЗамещающий = Истина;
				торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(Форма, ВыбранныйСтатус, ТекущийПользователь,,);
            КонецЕсли; 
		КонецЦикла; 
	Исключение
		//
	КонецПопытки;
	
	// Обработка строк, где пользователь является замещающим, но не согласующим
	Попытка
		Для Каждого СтрокаДЗ Из МассивОсновнойНеЗамещающий Цикл
			СтрокаДЗ.Согласовано = (СтрокаДЗ.СтатусДокумента <> ВыбранныйСтатус);
			Если СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус Тогда
				СогласующийИлиЗамещающий = Истина;
	
				// снимаем галочку и за согласующего тоже
				Для каждого Строка Из МассивСтрокДереваСогласования Цикл
					Если (Строка.Согласующий = СтрокаДЗ.Согласующий)
						И Строка.Замещающий = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
						И Строка.СтатусДокумента = ВыбранныйСтатус
						Тогда
						Строка.Согласовано = Ложь;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла; 
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры  

// гкс+ [разработка 2021]
Функция гкс_ПоДокументуЕстьИстория(Ссылка)Экспорт
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		Возврат Ложь;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СогласуемыйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 1 Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// гкс+ [Релиз17] Деснол
Функция гкс_ПолучитьСтатусыСКомментарием(СпособСогласования, ТекущийСтатус) Экспорт
	
	СписокСледующихСтатусов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК СледующийСтатус
	|ИЗ
	|	РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	|		ПО (торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования)
	|			И (торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус = &ТекущийСтатус)
	|			И (торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = &СпособСогласования)
	|			И (торо_НастройкиСтатусовСогласованияДокументов.Статус = торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус)
	|			И (торо_НастройкиСтатусовСогласованияДокументов.гкс_ТребуетсяКомментарий)";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СледующийСтатус) Тогда
			СписокСледующихСтатусов.Добавить(Выборка.СледующийСтатус);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат СписокСледующихСтатусов;
	
КонецФункции
// гкс- [Релиз17]

Процедура гкс_ДобавитьСпособСогласованияДляНовыхДокументов(Источник, Отказ)
	
	Если Не Отказ И Источник.ЭтоНовый() И Не ЗначениеЗаполнено(Источник.СпособСогласования) Тогда
		СтруктураПараметров = ПараметрыИспользованияСогласованияДокумента(Источник);
		
		Если Не СтруктураПараметров.ИспользоватьСогласование Тогда
			Возврат;
		КонецЕсли;
		
		ВидДокумента = СтруктураПараметров.ВидДокументаЗначение;
		Если СтруктураПараметров.ВидДокументаЗначение <> 
			Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты Тогда
			Возврат;
		КонецЕсли;	
		
		СпособСогласования = гкс_ПолучитьСпособСогласованияПоУмолчанию(
				ВидДокумента, Источник.Организация, Источник.Подразделение, Источник.ПодразделениеИсполнитель);	
		
		Источник.СпособСогласования = СпособСогласования;
			
		Источник.ДополнительныеСвойства.Вставить("гкс_НазначитьСтатусДокумента", Истина);
	КонецЕсли;
	
КонецПроцедуры	

Процедура гкс_НазначитьТекущийСтатусДляНовогоДокумента(Источник, Отказ) 
	
	Если Не Отказ Тогда
		Если Источник.ДополнительныеСвойства.Свойство("гкс_НазначитьСтатусДокумента") Тогда
			
			СтатусДокумента = торо_РаботаССогласованиямиПовтИсп.ПолучитьНачальныйСтатус(Источник.СпособСогласования);
			Если ЗначениеЗаполнено(СтатусДокумента) Тогда
								
				// Запись таблицы ИсторияСтатусов.
				МенеджерЗаписи = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период          = ТекущаяДатаСеанса();
				МенеджерЗаписи.СогласуемыйДокумент = Источник.Ссылка;
				Если Источник.ОбменДанными.Загрузка Тогда
					МенеджерЗаписи.Пользователь    = Источник.Ответственный;	
				Иначе	
					МенеджерЗаписи.Пользователь    = Пользователи.ТекущийПользователь();
				КонецЕсли;
				МенеджерЗаписи.ЗаКого          = Неопределено;
				МенеджерЗаписи.СтатусДокумента = СтатусДокумента;
				МенеджерЗаписи.Записать(Истина);
				
				// Запись текущего статуса документа.
				МенеджерЗаписи = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.СогласуемыйДокумент = Источник.Ссылка;
				МенеджерЗаписи.СтатусДокумента = СтатусДокумента;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
